10/data/attachments/e1a5685a52a2d937.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_d7692a9d-d0ce-457b-9faf-562185c50258</nif:username>
            <nif:friendToBeAdded>Richard_especially_Actions_55124_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>